#!/bin/bash
# ================================================================
# 文件名称：bak.sh
# 作    者：秋风画扇
# 创建日期：2019年07月20日 星期六 14时36分34秒
# 创建日期：2019年07月20日 星期六 14时36分34秒
# ================================================================
# 摘    要：
#			vim配置文件备份脚本

# =========================== 获取用户输入
# 格    式			含    义
#
# read answer			从标准输入读取一行并赋值给变量answer
#
# read first last		从标准输入读取一行，直至遇到第一个空白符或换行符。把用户键入的第一个词存到变量first中，把该行的剩余部分保存到变量last中
#
# read					标准输入读取一行并赋值给内置变量REPLY
#
# read –a arrayname		读入一组词，依次赋值给数组arrayname③


echo "# ==========================开始推送本地备份到远程仓库================================"
echo "# =========================== 本地状态"

starttime=`date +'%Y-%m-%d %H:%M:%S'`
start_seconds=$(date --date="$starttime" +%s);

git status

echo "# =========================== 开始添加文件到暂存区"

git add .

echo "# =========================== 添加完成"

echo "# =========================== 请输入日志："

read log

echo "# =========================== 开始将暂存区文件写入本地分支"

git commit -m "$log""   `date`"

echo "# =========================== 开始推送"
git push

echo "# =========================== 推送完成"

echo "# ==========================备份完成！================================"

# 统计时间
endtime=`date +'%Y-%m-%d %H:%M:%S'`
end_seconds=$(date --date="$endtime" +%s);
echo "耗时："$((end_seconds-start_seconds))"s"

